app/Controllers/Peminjaman.php

    public function index()
    {
        $data = [
            'title' => 'Manajemen Peminjaman',
            'peminjaman' => $this->peminjamanModel->findAll()
---
SELECT *
FROM `peminjaman`

    public function store()
    {
        // Validasi input
        $validation = $this->validate([
            'id_anggota' => 'required',
            'kode_buku' => 'required',
            'tanggal_pinjam' => 'required|valid_date',
            'tanggal_kembali' => 'required|valid_date',
        ]);

        if (!$validation) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Ambil data input
        $data = [
            'nomor_transaksi' => 'TRX-' . time(),
            'id_anggota' => $this->request->getPost('id_anggota'),
            'kode_buku' => $this->request->getPost('kode_buku'),
            'tanggal_pinjam' => $this->request->getPost('tanggal_pinjam'),
            'tanggal_kembali' => $this->request->getPost('tanggal_kembali'),
            'status' => 'dipinjam',
        ];

        // Simpan data ke database
        $this->peminjamanModel->insert($data);
---
INSERT INTO `peminjaman` (`nomor_transaksi`, `id_anggota`, `kode_buku`, `tanggal_pinjam`, `tanggal_kembali`, `status`) VALUES ('TRX-1734514829', '02', '01', '2024-12-18', '2024-12-19', 'dipinjam')