app/Controllers/Pengembalian.php

SELECT *
FROM `pengembalian`
---
    public function index()
    {
        $data = [
            'title' => 'Data Pengembalian',
            'pengembalian' => $this->pengembalianModel->findAll(),